{
  "buttons": {
    "sign-in": "Войти",
    "sign-up": "Зарегистрироваться",
    "sign-out": "Выйти",
    "main": "Главная страница",
    "rest": "REST клиент",
    "graphql": "GraphiQL клиент",
    "history": "История",
    "send": "Отправить",
    "add": "Добавить",
    "delete": "Удалить"
  },
  "Home": {
    "welcome": "Мы рады приветствовать Вас",
    "project": {
      "title": "О проекте",
      "content": "Проект REST/GraphQL Client — это полностью функциональное, легковесное веб-приложение, которое объединяет основные функции Postman и GraphiQL в единый унифицированный инструмент. Он позволяет пользователям беспрепятственно взаимодействовать как с RESTful API, так и с конечными точками GraphQL, предоставляя такие функции, как выбор метода, ввод URL, редактирование заголовков и визуализация запросов и ответов в реальном времени. Приложение также включает раздел истории для отслеживания и повторного просмотра предыдущих запросов API, что повышает производительность.\u000AПриложение создано с использованием React 18 и Next.js, что обеспечивает быстрый и отзывчивый пользовательский интерфейс. Оно поддерживает аутентификацию и авторизацию пользователей, обеспечивая доступ к своим мощным функциям. Дизайн соответствует современным веб-стандартам с семантической компоновкой, плавной анимацией и единым стилем на всех страницах. Приложение полностью протестировано, достигнув более 80% тестового покрытия, и развернуто на облачной платформе для легкого доступа.\u000AЭтот проект соответствует всем указанным требованиям, включая интернационализацию с поддержкой нескольких языков, обработку ошибок и адаптивный дизайн, обеспечивая надежную и удобную среду разработки API."
    },
    "developers": {
      "title": "Разработчики проекта",
      "role": {
        "team-lead": "Руководитель группы",
        "frontend-developer": "Frontend разработчик"
      },
      "names": {
        "oleksii": "Алексей Болотин",
        "diana": "Диана Абдыкасенова",
        "aliaksandr": "Александр Проневич"
      }
    },
    "course": {
      "title": "О курсе React",
      "content": "Курс React, организованный The Rolling Scopes School (RS School), — это комплексная бесплатная онлайн-программа, предназначенная для обучения разработчиков тонкостям React и его экосистемы. Курс рассчитан на студентов, прошедших RS School Stage #2, а также на новых студентов с практическим опытом работы с JavaScript, TypeScript, Git, NPM и связанными с ними инструментами веб-разработки.\u000AКурс делает акцент на практическом обучении, когда участники работают с реальными проектами, получают обратную связь от наставников и сотрудничают в рамках сообщества. Учебная программа охватывает основные концепции React, управление состоянием и продвинутые темы, такие как рендеринг на стороне сервера и оптимизация производительности. После успешного завершения студенты получают электронный сертификат и поощряются к участию в жизни сообщества в качестве наставников.\u000AЭта программа идеально подходит для тех, кто хочет углубить свои навыки React и получить практический опыт в среде совместного обучения."
    }
  },
  "auth": {
    "name": "Имя",
    "email": "E-mail",
    "password": "Пароль",
    "confirm-password": "Подтвердить пароль",
    "message-1-sign-up": "У вас уже есть аккаунт?",
    "message-1-sign-in": "У вас нет учетной записи?",
    "message-2": "сейчас."
  },
  "history": {
    "empty-1": "Вы не выполнили ни одного запроса",
    "empty-2": "Здесь пусто. Попробуйте:"
  },
  "methods": {
    "get": "Получить",
    "post": "Отправить",
    "put": "Обновить (полностью)",
    "delete": "Удалить",
    "patch": "Частично обновить"
  },
  "client": {
    "req-body": "Тело запроса (JSON)",
    "res-body": "Тело ответа",
    "res-header": "Заголовок ответа",
    "no-res-body": "Нет текста ответа",
    "res-statusText": "Текст статуса ответа",
    "res-statusCode": "Код состояния ответа",
    "no-res-header": "Нет заголовка ответа",
    "headers": "Заголовки",
    "variables": "Переменные",
    "key": "Ключ",
    "value": "Значение",
    "fill-key": "Пожалуйста, заполните ключ",
    "fill-value": "Пожалуйста, заполните значение",
    "fill-both": "Заполните поля ключа и значения"
  }
}
